In [1]:
import numpy as np
import pandas as pd

In [2]:
data = pd.DataFrame({
    'c1': np.arange(5),
    'c2': list('abcde'),
    'c3': np.linspace(0, 1, 5),
    'c4': ['red', 'yellow', 'blue', 'green', 'black'],
    'c5': np.arange('2021-12-25', '2021-12-30', dtype=np.datetime64)
})
data.to_csv('test.csv', index=False)

data

   c1 c2    c3      c4         c5
0   0  a  0.00     red 2021-12-25
1   1  b  0.25  yellow 2021-12-26
2   2  c  0.50    blue 2021-12-27
3   3  d  0.75   green 2021-12-28
4   4  e  1.00   black 2021-12-29

## 文件操作

文件读取

- `pd.read_csv(filepath_or_buffer, sep=',', header='infer', names=None, index_col=None, usecols=None, dtype=None, skiprows=None, nrows=None, parse_dates=False, encoding=None)`
- `pd.read_table(...)`
- `pd.read_excel(io, sheet_name=0, header=0, names=None, index_col=None, usecols=None, dtype=None, skiprows=None, nrows=None, parse_dates=False)`

In [3]:
df = pd.read_csv('test.csv')
df

   c1 c2    c3      c4          c5
0   0  a  0.00     red  2021-12-25
1   1  b  0.25  yellow  2021-12-26
2   2  c  0.50    blue  2021-12-27
3   3  d  0.75   green  2021-12-28
4   4  e  1.00   black  2021-12-29

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   c1      5 non-null      int64
 1   c2      5 non-null      object
 2   c3      5 non-null      float64
 3   c4      5 non-null      object
 4   c5      5 non-null      object
dtypes: float64(1), int64(1), object(3)
memory usage: 328.0+ bytes

In [5]:
# 不将第一行作为表头
pd.read_csv('test.csv', header=None)

    0   1     2       3           4
0  c1  c2    c3      c4          c5
1   0   a   0.0     red  2021-12-25
2   1   b  0.25  yellow  2021-12-26
3   2   c   0.5    blue  2021-12-27
4   3   d  0.75   green  2021-12-28
5   4   e   1.0   black  2021-12-29

In [6]:
# 将某几列作为索引
pd.read_csv('test.csv', index_col=['c1', 'c2'])

         c3      c4          c5
c1 c2
0  a   0.00     red  2021-12-25
1  b   0.25  yellow  2021-12-26
2  c   0.50    blue  2021-12-27
3  d   0.75   green  2021-12-28
4  e   1.00   black  2021-12-29

In [7]:
# 只读取某几列
pd.read_csv('test.csv', usecols=['c1', 'c2'])

   c1 c2
0   0  a
1   1  b
2   2  c
3   3  d
4   4  e

In [8]:
# 解析时间戳
df = pd.read_csv('test.csv', parse_dates=['c5'])
df

   c1 c2    c3      c4         c5
0   0  a  0.00     red 2021-12-25
1   1  b  0.25  yellow 2021-12-26
2   2  c  0.50    blue 2021-12-27
3   3  d  0.75   green 2021-12-28
4   4  e  1.00   black 2021-12-29

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   c1      5 non-null      int64
 1   c2      5 non-null      object
 2   c3      5 non-null      float64
 3   c4      5 non-null      object
 4   c5      5 non-null      datetime64[ns]
dtypes: datetime64[ns](1), float64(1), int64(1), object(2)
memory usage: 328.0+ bytes

In [10]:
# 只读取前几行
pd.read_csv('test.csv', nrows=2)

   c1 c2    c3      c4          c5
0   0  a  0.00     red  2021-12-25
1   1  b  0.25  yellow  2021-12-26

文件写入

- `DataFrame.to_csv(path_or_buf=None, sep=',', na_rep='', float_format=None, columns=None, header=True, index=True, index_label=None, encoding=None, date_format=None)`
- `DataFrame.to_excel(excel_writer, sheet_name='Sheet1', na_rep='', columns=None, header=True, index=True)`
- `DataFrame.to_markdown(buf=None, mode='wt', index=True)`
- `DataFrame.to_latex(header=True, index=True)`

In [11]:
# 不保存索引
df.to_csv('test.csv', index=False)

In [12]:
# 保存为txt
df.to_csv('test.txt', sep='\t', index=False)

In [13]:
# 转为markdown格式
print(df.to_markdown(index=False))

|   c1 | c2   |   c3 | c4     | c5                  |
|-----:|:-----|-----:|:-------|:--------------------|
|    0 | a    | 0    | red    | 2021-12-25 00:00:00 |
|    1 | b    | 0.25 | yellow | 2021-12-26 00:00:00 |
|    2 | c    | 0.5  | blue   | 2021-12-27 00:00:00 |
|    3 | d    | 0.75 | green  | 2021-12-28 00:00:00 |
|    4 | e    | 1    | black  | 2021-12-29 00:00:00 |

In [14]:
# 转为markdown格式
print(df.to_markdown(index=False, tablefmt='grid'))

+------+------+------+--------+---------------------+
|   c1 | c2   |   c3 | c4     | c5                  |
+======+======+======+========+=====================+
|    0 | a    | 0    | red    | 2021-12-25 00:00:00 |
+------+------+------+--------+---------------------+
|    1 | b    | 0.25 | yellow | 2021-12-26 00:00:00 |
+------+------+------+--------+---------------------+
|    2 | c    | 0.5  | blue   | 2021-12-27 00:00:00 |
+------+------+------+--------+---------------------+
|    3 | d    | 0.75 | green  | 2021-12-28 00:00:00 |
+------+------+------+--------+---------------------+
|    4 | e    | 1    | black  | 2021-12-29 00:00:00 |
+------+------+------+--------+---------------------+

In [15]:
# 转为latex格式
print(df.to_latex(index=False))

\begin{tabular}{rlrll}
\toprule
 c1 & c2 &   c3 &     c4 &         c5 \\
\midrule
  0 &  a & 0.00 &    red & 2021-12-25 \\
  1 &  b & 0.25 & yellow & 2021-12-26 \\
  2 &  c & 0.50 &   blue & 2021-12-27 \\
  3 &  d & 0.75 &  green & 2021-12-28 \\
  4 &  e & 1.00 &  black & 2021-12-29 \\
\bottomrule
\end{tabular}

## 数据结构

### Series

一维数据

- `pd.Series(data=None, index=None, dtype=None, name=None, copy=False)`

In [16]:
s = pd.Series(data=[100, 'a', {'dic1': 5}],
              index=pd.Index(['id1', 20, 'third'], name='my_idx'),
              dtype='object',
              name='my_name')
s

my_idx
id1              100
20                 a
third    {'dic1': 5}
Name: my_name, dtype: object

In [17]:
# 数据
s.values

array([100, 'a', {'dic1': 5}], dtype=object)

In [18]:
# 索引
s.index

Index(['id1', 20, 'third'], dtype='object', name='my_idx')

In [19]:
# 类型
s.dtype

dtype('O')

In [20]:
# 名称
s.name

'my_name'

In [21]:
# 大小
s.shape

(3,)

In [22]:
# 利用索引访问数据
s['id1'], s[20], s['third']

(100, 'a', {'dic1': 5})

### DataFrame

多维数据

- `pd.DataFrame(data=None, index=None, columns=None, dtype=None, copy=None)`

In [23]:
# 列名与数据分离
df = pd.DataFrame(data=[[1, 'a', 1.2],
                        [2, 'b', 2.2],
                        [3, 'c', 3.2]],
                  index=['row_%d' % i for i in range(3)],
                  columns=['col_%d' % i for i in range(3)])
df

       col_0 col_1  col_2
row_0      1     a    1.2
row_1      2     b    2.2
row_2      3     c    3.2

In [24]:
# 列名映射数据
df = pd.DataFrame(data={'col_0': [1, 2, 3],
                        'col_1': list('abc'),
                        'col_2': [1.2, 2.2, 3.2]},
                  index=['row_%d' % i for i in range(3)])
df

       col_0 col_1  col_2
row_0      1     a    1.2
row_1      2     b    2.2
row_2      3     c    3.2

In [25]:
# 取出某一列
df['col_0']

row_0    1
row_1    2
row_2    3
Name: col_0, dtype: int64

In [26]:
# 取出某几列
df[['col_1', 'col_2']]

      col_1  col_2
row_0     a    1.2
row_1     b    2.2
row_2     c    3.2

In [27]:
# 数据
df.values

array([[1, 'a', 1.2],
       [2, 'b', 2.2],
       [3, 'c', 3.2]], dtype=object)

In [28]:
# 索引
df.index

Index(['row_0', 'row_1', 'row_2'], dtype='object')

In [29]:
# 列名
df.columns

Index(['col_0', 'col_1', 'col_2'], dtype='object')

In [30]:
# 类型
df.dtypes

col_0      int64
col_1     object
col_2    float64
dtype: object

In [31]:
# 形状
df.shape

(3, 3)

In [32]:
# 转置
df.T

      row_0 row_1 row_2
col_0     1     2     3
col_1     a     b     c
col_2   1.2   2.2   3.2

#### 常用函数

In [33]:
df = pd.read_csv('data/learn_pandas.csv')
df = df[df.columns[:7]]

汇总函数

- `DataFrame.head(n=5)`：前n行
- `DataFrame.tail(n=5)`：后n行
- `DataFrame.info(verbose=None, buf=None, max_cols=None)`：信息概况
- `DataFrame.describe(include=None, exclude=None, datetime_is_numeric=False)`：统计量

In [34]:
df.head()

,School,Grade,Name,Gender,Height,Weight,Transfer
0,Shanghai Jiao Tong University,Freshman,Gaopeng Yang,Female,158.9,46.0,N
1,Peking University,Freshman,Changqiang You,Male,166.5,70.0,N
2,Shanghai Jiao Tong University,Senior,Mei Sun,Male,188.9,89.0,N
3,Fudan University,Sophomore,Xiaojuan Sun,Female,NaN,41.0,N
4,Fudan University,Sophomore,Gaojuan You,Male,174.0,74.0,N

In [35]:
df.tail()

,School,Grade,Name,Gender,Height,Weight,Transfer
195,Fudan University,Junior,Xiaojuan Sun,Female,153.9,46.0,N
196,Tsinghua University,Senior,Li Zhao,Female,160.9,50.0,N
197,Shanghai Jiao Tong University,Senior,Chengqiang Chu,Female,153.9,45.0,N
198,Shanghai Jiao Tong University,Senior,Chengmei Shen,Male,175.3,71.0,N
199,Tsinghua University,Sophomore,Chunpeng Lv,Male,155.7,51.0,N

In [36]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   School    200 non-null    object
 1   Grade     200 non-null    object
 2   Name      200 non-null    object
 3   Gender    200 non-null    object
 4   Height    183 non-null    float64
 5   Weight    189 non-null    float64
 6   Transfer  188 non-null    object
dtypes: float64(2), object(5)
memory usage: 11.1+ KB

In [37]:
# 只计算数值型（int, float）数据
df.describe()

           Height      Weight
count  183.000000  189.000000
mean   163.218033   55.015873
std      8.608879   12.824294
min    145.400000   34.000000
25%    157.150000   46.000000
50%    161.900000   51.000000
75%    167.500000   65.000000
max    193.900000   89.000000

统计函数

- `DataFrame.max(axis=None, skipna=None, numeric_only=None)`：最大值
- `DataFrame.min(axis=None, skipna=None, numeric_only=None)`：最小值
- `DataFrame.sum(axis=None, skipna=None, numeric_only=None)`：求和
- `DataFrame.mean(axis=None, skipna=None, numeric_only=None)`：均值
- `DataFrame.median(axis=None, skipna=None, numeric_only=None)`：中位数
- `DataFrame.std(axis=None, skipna=None, numeric_only=None)`：标准差
- `DataFrame.var(axis=None, skipna=None, numeric_only=None)`：方差
- `DataFrame.quantile(q=0.5, axis=0, numeric_only=True)`：分位数
- `DataFrame.idxmax(axis=0, skipna=True)`：最大值对应的索引
- `DataFrame.idxmin(axis=0, skipna=True)`：最小值对应的索引
- `DataFrame.count(axis=0, numeric_only=False)`：非缺失值个数

唯一值函数

- `Series.unique()`：去重
- `DataFrame.nunique(axis=0, dropna=True)`：去重后的数量
- `DataFrame.value_counts(subset=None, normalize=False, sort=True, ascending=False, dropna=True)`：各取值的数量
- `DataFrame.drop_duplicates(subset=None, keep='first', inplace=False)`：舍弃重复行
- `DataFrame.duplicated(subset=None, keep='first')`：返回是否重复的布尔值

In [38]:
df['School'].unique()

array(['Shanghai Jiao Tong University', 'Peking University',
       'Fudan University', 'Tsinghua University'], dtype=object)

In [39]:
df['School'].nunique()

4

In [40]:
df['School'].value_counts()

Tsinghua University              69
Shanghai Jiao Tong University    57
Fudan University                 40
Peking University                34
Name: School, dtype: int64

In [41]:
df_demo = df[['Gender', 'Transfer', 'Name']]
df_demo.drop_duplicates(['Gender', 'Transfer'])

    Gender Transfer            Name
0   Female        N    Gaopeng Yang
1     Male        N  Changqiang You
12  Female      NaN        Peng You
21    Male      NaN   Xiaopeng Shen
36    Male        Y    Xiaojuan Qin
43  Female        Y      Gaoli Feng

In [42]:
# 保留最后一次出现的行
df_demo.drop_duplicates(['Gender', 'Transfer'], keep='last')

     Gender Transfer            Name
147    Male      NaN        Juan You
150    Male        Y   Chengpeng You
169  Female        Y   Chengquan Qin
194  Female      NaN     Yanmei Qian
197  Female        N  Chengqiang Chu
199    Male        N     Chunpeng Lv

In [43]:
# 保留只出现一次的行
df_demo.drop_duplicates(['Gender', 'Name'], keep=False).head()

   Gender Transfer            Name
0  Female        N    Gaopeng Yang
1    Male        N  Changqiang You
2    Male        N         Mei Sun
4    Male        N     Gaojuan You
5  Female        N     Xiaoli Qian

In [44]:
df_demo.duplicated(['Gender', 'Transfer']).head()

0    False
1    False
2     True
3     True
4     True
dtype: bool

映射替换

- `DataFrame.replace(to_replace=None, value=None, inplace=False, limit=None, regex=False, method='pad')`

In [45]:
df['Gender'].head()

0    Female
1      Male
2      Male
3    Female
4      Male
Name: Gender, dtype: object

In [46]:
# 单个值替换
df['Gender'].replace('Female', 0).head()

0       0
1    Male
2    Male
3       0
4    Male
Name: Gender, dtype: object

In [47]:
# 构造字典
df['Gender'].replace({'Female': 0, 'Male': 1}).head()

0    0
1    1
2    1
3    0
4    1
Name: Gender, dtype: int64

In [48]:
# 构造列表
df['Gender'].replace(['Female', 'Male'], 0).head()

0    0
1    0
2    0
3    0
4    0
Name: Gender, dtype: int64

In [49]:
# 构造列表
df['Gender'].replace(['Female', 'Male'], [0, 1]).head()

0    0
1    1
2    1
3    0
4    1
Name: Gender, dtype: int64

In [50]:
df_demo.head()

   Gender Transfer            Name
0  Female        N    Gaopeng Yang
1    Male        N  Changqiang You
2    Male        N         Mei Sun
3  Female        N    Xiaojuan Sun
4    Male        N     Gaojuan You

In [51]:
# 不同列指定不同值
df_demo.replace({'Gender': 'Male', 'Transfer': 'N'}, 1).head()

   Gender Transfer            Name
0  Female        1    Gaopeng Yang
1       1        1  Changqiang You
2       1        1         Mei Sun
3  Female        1    Xiaojuan Sun
4       1        1     Gaojuan You

In [52]:
# 同一列指定不同值
df_demo.replace({'Gender': {'Female': 0, 'Male': 1}}).head()

   Gender Transfer            Name
0       0        N    Gaopeng Yang
1       1        N  Changqiang You
2       1        N         Mei Sun
3       0        N    Xiaojuan Sun
4       1        N     Gaojuan You

逻辑替换

- `DataFrame.where(cond, other=nan, inplace=False, axis=None)`：替换False的值
- `DataFrame.mask(cond, other=nan, inplace=False, axis=None)`：替换True的值

In [53]:
s = pd.Series([-1, 1.2345, 100, -50])
s

0     -1.0000
1      1.2345
2    100.0000
3    -50.0000
dtype: float64

In [54]:
s.where(s < 0)

0    -1.0
1     NaN
2     NaN
3   -50.0
dtype: float64

In [55]:
s.where(s < 0, 33)

0    -1.0
1    33.0
2    33.0
3   -50.0
dtype: float64

In [56]:
s.mask(s < 0)

0         NaN
1      1.2345
2    100.0000
3         NaN
dtype: float64

In [57]:
s.mask(s < 0, 33)

0     33.0000
1      1.2345
2    100.0000
3     33.0000
dtype: float64

In [58]:
# 传入布尔序列
s.mask([True, False, True, False], 20)

0    20.0000
1     1.2345
2    20.0000
3   -50.0000
dtype: float64

数值替换

- `DataFrame.round(decimals=0)`：四舍五入
- `DataFrame.abs()`：绝对值
- `DataFrame.clip(lower=None, upper=None, axis=None, inplace=False)`：按阈值调整

In [59]:
s = pd.Series([-1, 1.2345, 100, -50])
s

0     -1.0000
1      1.2345
2    100.0000
3    -50.0000
dtype: float64

In [60]:
s.round(2)

0     -1.00
1      1.23
2    100.00
3    -50.00
dtype: float64

In [61]:
s.abs()

0      1.0000
1      1.2345
2    100.0000
3     50.0000
dtype: float64

In [62]:
s.clip(-2, 2)

0   -1.0000
1    1.2345
2    2.0000
3   -2.0000
dtype: float64

In [63]:
lower = np.arange(-2, 6, 2) - 2
upper = np.arange(4) + 2
lower, upper

(array([-4, -2,  0,  2]), array([2, 3, 4, 5]))

In [64]:
s.clip(lower, upper)

0   -1.0000
1    1.2345
2    4.0000
3    2.0000
dtype: float64

排序函数

- `DataFrame.sort_values(by, axis=0, ascending=True, inplace=False, na_position='last')`
- `DataFrame.sort_index(axis=0, level=None, ascending=True, inplace=False, na_position='last')`

In [65]:
df_demo = df[['Grade', 'Name', 'Height', 'Weight']].set_index(['Grade', 'Name'])
df_demo.head()

                          Height  Weight
Grade     Name
Freshman  Gaopeng Yang     158.9    46.0
          Changqiang You   166.5    70.0
Senior    Mei Sun          188.9    89.0
Sophomore Xiaojuan Sun       NaN    41.0
          Gaojuan You      174.0    74.0

In [66]:
# 默认升序
df_demo.sort_values('Height').head()

                         Height  Weight
Grade     Name
Junior    Xiaoli Chu      145.4    34.0
Senior    Gaomei Lv       147.3    34.0
Sophomore Peng Han        147.8    34.0
Senior    Changli Lv      148.7    41.0
Sophomore Changjuan You   150.5    40.0

In [67]:
# 降序
df_demo.sort_values('Height', ascending=False).head()

                        Height  Weight
Grade    Name
Senior   Xiaoqiang Qin   193.9    79.0
         Mei Sun         188.9    89.0
         Gaoli Zhao      186.5    83.0
Freshman Qiang Han       185.3    87.0
Senior   Qiang Zheng     183.9    87.0

In [68]:
# 多属性排序
df_demo.sort_values(['Weight', 'Height'], ascending=[True, False]).head()

                       Height  Weight
Grade     Name
Sophomore Peng Han      147.8    34.0
Senior    Gaomei Lv     147.3    34.0
Junior    Xiaoli Chu    145.4    34.0
Sophomore Qiang Zhou    150.5    36.0
Freshman  Yanqiang Xu   152.4    38.0

In [69]:
df_demo.sort_index(level=['Grade', 'Name'], ascending=[True, False]).head()

                        Height  Weight
Grade    Name
Freshman Yanquan Wang    163.5    55.0
         Yanqiang Xu     152.4    38.0
         Yanqiang Feng   162.3    51.0
         Yanpeng Lv        NaN    65.0
         Yanli Zhang     165.1    52.0

函数映射

- `DataFrame.apply(func, axis=0, raw=False, result_type=None)`

In [70]:
df_demo = df[['Height', 'Weight']]
df_demo.head()

   Height  Weight
0   158.9    46.0
1   166.5    70.0
2   188.9    89.0
3     NaN    41.0
4   174.0    74.0

In [71]:
# 自定义函数
def func(x):
    return x.max() - x.min()


df_demo.apply(func)

Height    48.5
Weight    55.0
dtype: float64

In [72]:
# 匿名函数
df_demo.apply(lambda x: x.max() - x.min())

Height    48.5
Weight    55.0
dtype: float64

In [73]:
# 默认按列
df_demo.apply(np.sum)

Height    29868.9
Weight    10398.0
dtype: float64

In [74]:
# 按行
df_demo.apply(np.sum, axis=1).head()

0    204.9
1    236.5
2    277.9
3     41.0
4    248.0
dtype: float64

#### 窗口对象

滑动窗口

- `DataFrame.rolling(window, min_periods=None, center=False, on=None, axis=0)`：窗口大小固定

In [75]:
s = pd.Series(np.arange(1, 6))
s

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [76]:
roller = s.rolling(3)
roller

Rolling [window=3,center=False,axis=0,method=single]

In [77]:
# 默认在窗口结束位置显示结果
roller.sum()

0     NaN
1     NaN
2     6.0
3     9.0
4    12.0
dtype: float64

In [78]:
# 窗口起始位置显示结果
s.rolling(3).sum().shift(-2)

0     6.0
1     9.0
2    12.0
3     NaN
4     NaN
dtype: float64

In [79]:
roller.apply(np.mean)

0    NaN
1    NaN
2    2.0
3    3.0
4    4.0
dtype: float64

滑窗函数

- `DataFrame.shift(periods=1, freq=None, axis=0, fill_value=None)`：向后滑动
- `DataFrame.diff(periods=1, axis=0)`：减去前面值（非差分）
- `DataFrame.pct_change(periods=1, fill_method='pad', limit=None, freq=None)`：和前面值的百分比变化

In [80]:
s = pd.Series(np.arange(1, 6))
s

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [81]:
# s.rolling(3).apply(lambda x: list(x)[0])
s.shift(2)

0    NaN
1    NaN
2    1.0
3    2.0
4    3.0
dtype: float64

In [82]:
# s.rolling(3).apply(lambda x: list(x)[-1] - list(x)[0])
s.diff(2)

0    NaN
1    NaN
2    2.0
3    2.0
4    2.0
dtype: float64

In [83]:
# s.rolling(3).apply(lambda x: (list(x)[-1] - list(x)[0]) / list(x)[0])
s.pct_change(2)

0         NaN
1         NaN
2    2.000000
3    1.000000
4    0.666667
dtype: float64

扩张窗口

- `DataFrame.expanding(min_periods=1, center=None, axis=0)`：窗口大小递增

In [84]:
s = pd.Series([3, 1, 7, 5, 2])
s

0    3
1    1
2    7
3    5
4    2
dtype: int64

In [85]:
s.expanding(3).sum()

0     NaN
1     NaN
2    11.0
3    16.0
4    18.0
dtype: float64

In [86]:
# s.expanding().max()
s.cummax()

0    3
1    3
2    7
3    7
4    7
dtype: int64

In [87]:
# s.expanding().sum()
s.cumsum()

0     3
1     4
2    11
3    16
4    18
dtype: int64

In [88]:
# s.expanding().apply(lambda x: np.prod(x))
s.cumprod()

0      3
1      3
2     21
3    105
4    210
dtype: int64

## 练习题

### Ex1 口袋妖怪数据集

In [89]:
df_ex = pd.read_csv('data/pokemon.csv')
df_ex.head()

,#,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed
0,1,Bulbasaur,Grass,Poison,318,45,49,49,65,65,45
1,2,Ivysaur,Grass,Poison,405,60,62,63,80,80,60
2,3,Venusaur,Grass,Poison,525,80,82,83,100,100,80
3,3,VenusaurMega Venusaur,Grass,Poison,625,80,100,123,122,120,80
4,4,Charmander,Fire,NaN,309,39,52,43,60,50,65

In [90]:
# 对 HP, Attack, Defense, Sp. Atk, Sp. Def, Speed 进行加总，验证是否为 Total 值
df_ex['Total'] == df_ex[['HP', 'Attack', 'Defense', 'Sp. Atk', 'Sp. Def', 'Speed']].sum(axis=1)

0      True
1      True
2      True
3      True
4      True
       ...
795    True
796    True
797    True
798    True
799    True
Length: 800, dtype: bool

In [91]:
# 第一属性的种类数量
df_ex.drop_duplicates(['#'])['Type 1'].nunique()

18

In [92]:
# 前三多数量对应的种类
df_ex.drop_duplicates(['#'])['Type 1'].value_counts().head(3)

Water     105
Normal     93
Grass      66
Name: Type 1, dtype: int64

In [93]:
# 第一属性和第二属性的组合种类
df_ex.drop_duplicates(['#'])[['Type 1', 'Type 2']].drop_duplicates()

      Type 1  Type 2
0      Grass  Poison
4       Fire     NaN
6       Fire  Flying
9      Water     NaN
13       Bug     NaN
..       ...     ...
773     Rock   Fairy
778    Ghost   Grass
790   Flying  Dragon
797  Psychic   Ghost
799     Fire   Water

[143 rows x 2 columns]

In [94]:
# 尚未出现过的属性组合
type1_sets = df_ex.drop_duplicates(['#'])['Type 1'].unique()
type2_sets = df_ex.drop_duplicates(['#'])['Type 2'].unique()
feature_sets = [list(x) for x in df_ex.drop_duplicates(['#'])[['Type 1', 'Type 2']].drop_duplicates().values]
pd.DataFrame([[a, b] for a in type1_sets for b in type2_sets if [a, b] not in feature_sets])

          0         1
0     Grass     Grass
1     Grass      Rock
2     Grass     Water
3     Grass  Electric
4     Grass      Fire
..      ...       ...
194  Flying      Fire
195  Flying      Dark
196  Flying     Ghost
197  Flying       Bug
198  Flying    Normal

[199 rows x 2 columns]

In [95]:
# 取出物攻，超过120的替换为 high ，不足50的替换为 low ，否则设为 mid
def func(x):
    if x > 120:
        return 'high'
    elif x < 50:
        return 'low'
    return 'mid'


df_ex['Attack'].apply(func).head()

0    low
1    mid
2    mid
3    mid
4    mid
Name: Attack, dtype: object

In [96]:
# 取出第一属性，用 replace 替换所有字母为大写
type1_list = list(df_ex.drop_duplicates(['#'])['Type 1'].unique())
df_ex['Type 1'].replace(type1_list, [x.upper() for x in list(type1_list)])

0        GRASS
1        GRASS
2        GRASS
3        GRASS
4         FIRE
        ...
795       ROCK
796       ROCK
797    PSYCHIC
798    PSYCHIC
799       FIRE
Name: Type 1, Length: 800, dtype: object

In [97]:
# 取出第一属性，用 apply 替换所有字母为大写
df_ex['Type 1'].apply(lambda x: x.upper())

0        GRASS
1        GRASS
2        GRASS
3        GRASS
4         FIRE
        ...
795       ROCK
796       ROCK
797    PSYCHIC
798    PSYCHIC
799       FIRE
Name: Type 1, Length: 800, dtype: object

In [98]:
# 求每个妖怪六项能力的离差，即所有能力中偏离中位数最大的值，添加到 df 并从大到小排序
df_ex_demo = df_ex[['HP', 'Attack', 'Defense', 'Sp. Atk', 'Sp. Def', 'Speed']]
df_ex['deviation'] = (df_ex_demo - df_ex_demo.median()).abs().max(axis=1)
df_ex.sort_values(['deviation'], ascending=False).head()

,#,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,deviation
261,242,Blissey,Normal,NaN,540,255,10,10,75,135,55,190.0
121,113,Chansey,Normal,NaN,450,250,5,5,35,105,50,185.0
230,213,Shuckle,Bug,Rock,505,20,10,230,10,230,5,160.0
224,208,SteelixMega Steelix,Steel,Ground,610,75,125,230,55,95,30,160.0
333,306,AggronMega Aggron,Steel,NaN,630,70,140,230,60,80,50,160.0

### Ex2 指数加权窗口

In [99]:
np.random.seed(0)
s = pd.Series(np.random.randint(-1, 2, 30).cumsum())
s.head()

0   -1
1   -1
2   -2
3   -2
4   -2
dtype: int64

In [100]:
s.ewm(alpha=0.2).mean().head()

0   -1.000000
1   -1.000000
2   -1.409836
3   -1.609756
4   -1.725845
dtype: float64

In [101]:
# 作为扩张窗口的 ewm 窗口
def func(x):
    alpha = 0.2
    up, down = 0, 0
    for i in range(len(x)):
        up += (1 - alpha) ** i * x[len(x) - 1 - i]
        down += (1 - alpha) ** i
    return up / down


s.expanding().apply(func).head()

0   -1.000000
1   -1.000000
2   -1.409836
3   -1.609756
4   -1.725845
dtype: float64

In [102]:
def func(x):
    x = list(x)
    alpha = 0.2
    up, down = 0, 0
    for i in range(len(x)):
        up += (1 - alpha) ** i * x[len(x) - 1 - i]
        down += (1 - alpha) ** i
    return up / down


s.rolling(3).apply(func).head()

0         NaN
1         NaN
2   -1.409836
3   -1.737705
4   -2.000000
dtype: float64

## 索引

- `DataFrame.loc[...]`

In [103]:
df_demo = df.set_index('Name')
df_demo.head()

,School,Grade,Gender,Height,Weight,Transfer
Name,,,,,,
Gaopeng Yang,Shanghai Jiao Tong University,Freshman,Female,158.9,46.0,N
Changqiang You,Peking University,Freshman,Male,166.5,70.0,N
Mei Sun,Shanghai Jiao Tong University,Senior,Male,188.9,89.0,N
Xiaojuan Sun,Fudan University,Sophomore,Female,NaN,41.0,N
Gaojuan You,Fudan University,Sophomore,Male,174.0,74.0,N

In [104]:
# 单索引
df_demo.loc['Gaopeng Yang']

School      Shanghai Jiao Tong University
Grade                            Freshman
Gender                             Female
Height                              158.9
Weight                               46.0
Transfer                                N
Name: Gaopeng Yang, dtype: object

In [105]:
# 索引 + 列名
df_demo.loc['Changqiang You', 'School']

'Peking University'

In [106]:
# 多选：索引 + 列名
df_demo.loc[['Gaopeng Yang', 'Changqiang You'], ['Grade', 'School']]

                   Grade                         School
Name
Gaopeng Yang    Freshman  Shanghai Jiao Tong University
Changqiang You  Freshman              Peking University

In [107]:
# 切片，字符串索引，包含终止元素
df_demo.loc['Gaojuan You':'Gaoqiang Qian', 'School':'Gender']

                                      School      Grade  Gender
Name
Gaojuan You                 Fudan University  Sophomore    Male
Xiaoli Qian              Tsinghua University   Freshman  Female
Qiang Chu      Shanghai Jiao Tong University   Freshman  Female
Gaoqiang Qian            Tsinghua University     Junior  Female

In [108]:
df_demo_copy = df_demo.copy()
df_demo_copy.index = range(df_demo.shape[0])
df_demo_copy.head()

                          School      Grade  Gender  Height  Weight Transfer
0  Shanghai Jiao Tong University   Freshman  Female   158.9    46.0        N
1              Peking University   Freshman    Male   166.5    70.0        N
2  Shanghai Jiao Tong University     Senior    Male   188.9    89.0        N
3               Fudan University  Sophomore  Female     NaN    41.0        N
4               Fudan University  Sophomore    Male   174.0    74.0        N

In [109]:
# 切片，整数索引，包含终止元素
df_demo_copy.loc[2:4, 'School':'Gender']

                          School      Grade  Gender
2  Shanghai Jiao Tong University     Senior    Male
3               Fudan University  Sophomore  Female
4               Fudan University  Sophomore    Male

In [110]:
# 布尔索引，数值型数据
df_demo.loc[df_demo['Weight'] > 80]

,School,Grade,Gender,Height,Weight,Transfer
Name,,,,,,
Mei Sun,Shanghai Jiao Tong University,Senior,Male,188.9,89.0,N
Qiang Zheng,Shanghai Jiao Tong University,Senior,Male,183.9,87.0,N
Qiang Han,Peking University,Freshman,Male,185.3,87.0,N
Chengpeng Zhou,Fudan University,Senior,Male,177.1,81.0,N
Feng Han,Shanghai Jiao Tong University,Sophomore,Male,183.4,82.0,N
Changpeng Zhao,Peking University,Freshman,Male,181.3,83.0,N
Chunli Zhao,Shanghai Jiao Tong University,Freshman,Male,180.2,83.0,N
Gaoli Zhao,Shanghai Jiao Tong University,Senior,Male,186.5,83.0,N

In [111]:
# 布尔索引，category 型数据
df_demo.loc[df_demo['Grade'].isin(['Freshman', 'Senior'])].head()

,School,Grade,Gender,Height,Weight,Transfer
Name,,,,,,
Gaopeng Yang,Shanghai Jiao Tong University,Freshman,Female,158.9,46.0,N
Changqiang You,Peking University,Freshman,Male,166.5,70.0,N
Mei Sun,Shanghai Jiao Tong University,Senior,Male,188.9,89.0,N
Xiaoli Qian,Tsinghua University,Freshman,Female,158.0,51.0,N
Qiang Chu,Shanghai Jiao Tong University,Freshman,Female,162.5,52.0,N

In [112]:
# 布尔索引，复合条件
cond1_1 = df_demo['School'] == 'Fudan University'
cond1_2 = df_demo['Grade'] == 'Senior'
cond1_3 = df_demo['Weight'] > 80
cond1   = cond1_1 & cond1_2 & cond1_3
cond2_1 = df_demo['School'] == 'Peking University'
cond2_2 = df_demo['Grade'] == 'Freshman'
cond2_3 = df_demo['Height'] > 180
cond2   = cond2_1 & cond2_2 & cond2_3
df_demo.loc[cond1 | cond2]

                           School     Grade Gender  Height  Weight Transfer
Name
Qiang Han       Peking University  Freshman   Male   185.3    87.0        N
Chengpeng Zhou   Fudan University    Senior   Male   177.1    81.0        N
Changpeng Zhao  Peking University  Freshman   Male   181.3    83.0        N

- `DataFrame.select_dtypes(include=None, exclude=None)`：根据数据类型选择列

In [113]:
# df.loc[:, df.dtypes != object].head()
df.select_dtypes('number').head()

   Height  Weight
0   158.9    46.0
1   166.5    70.0
2   188.9    89.0
3     NaN    41.0
4   174.0    74.0

In [114]:
# 布尔索引，自定义函数
def func(x):
    return (x['Grade'] == 'Freshman') & (x['Height'] > 180)


df_demo.loc[func]

,School,Grade,Gender,Height,Weight,Transfer
Name,,,,,,
Qiang Han,Peking University,Freshman,Male,185.3,87.0,N
Changpeng Zhao,Peking University,Freshman,Male,181.3,83.0,N
Chunli Zhao,Shanghai Jiao Tong University,Freshman,Male,180.2,83.0,N

In [115]:
# 布尔索引，匿名函数
df_demo.loc[lambda x: 'Quan Zhao', lambda x: 'Gender']

'Female'

In [116]:
# 布尔索引，匿名函数，切片
df_demo.loc[lambda x: slice('Gaojuan You', 'Gaoqiang Qian')]

,School,Grade,Gender,Height,Weight,Transfer
Name,,,,,,
Gaojuan You,Fudan University,Sophomore,Male,174.0,74.0,N
Xiaoli Qian,Tsinghua University,Freshman,Female,158.0,51.0,N
Qiang Chu,Shanghai Jiao Tong University,Freshman,Female,162.5,52.0,N
Gaoqiang Qian,Tsinghua University,Junior,Female,161.9,50.0,N

- `DataFrame.iloc[...]`

In [121]:
# 整数索引，行
df_demo.iloc[1]

School      Peking University
Grade                Freshman
Gender                   Male
Height                  166.5
Weight                   70.0
Transfer                    N
Name: Changqiang You, dtype: object

In [117]:
# 整数索引，行 + 列
df_demo.iloc[1, 1]

'Freshman'

In [119]:
# 整数索引，多选
df_demo.iloc[[1, 2], [1, 2]]

                   Grade Gender
Name
Changqiang You  Freshman   Male
Mei Sun           Senior   Male

In [120]:
# 切片索引
df_demo.iloc[1:3, 2:4]

               Gender  Height
Name
Changqiang You   Male   166.5
Mei Sun          Male   188.9

In [123]:
# 切片索引，匿名函数
df_demo.iloc[lambda x: slice(2, 4)]

,School,Grade,Gender,Height,Weight,Transfer
Name,,,,,,
Mei Sun,Shanghai Jiao Tong University,Senior,Male,188.9,89.0,N
Xiaojuan Sun,Fudan University,Sophomore,Female,NaN,41.0,N

In [126]:
# 布尔索引
df_demo.iloc[(df_demo['Weight'] > 85).values]

,School,Grade,Gender,Height,Weight,Transfer
Name,,,,,,
Mei Sun,Shanghai Jiao Tong University,Senior,Male,188.9,89.0,N
Qiang Zheng,Shanghai Jiao Tong University,Senior,Male,183.9,87.0,N
Qiang Han,Peking University,Freshman,Male,185.3,87.0,N

- `DataFrame.query(expr, inplace=False)`

In [129]:
df.query('Grade == "Senior" & Height > 180')

,School,Grade,Name,Gender,Height,Weight,Transfer
2,Shanghai Jiao Tong University,Senior,Mei Sun,Male,188.9,89.0,N
23,Shanghai Jiao Tong University,Senior,Qiang Zheng,Male,183.9,87.0,N
134,Shanghai Jiao Tong University,Senior,Gaoli Zhao,Male,186.5,83.0,N
193,Tsinghua University,Senior,Xiaoqiang Qin,Male,193.9,79.0,N

In [133]:
df.query('Height > Height.mean() and Grade not in ["Junior", "Senior", "Freshman"]')

,School,Grade,Name,Gender,Height,Weight,Transfer
4,Fudan University,Sophomore,Gaojuan You,Male,174.0,74.0,N
40,Tsinghua University,Sophomore,Li Wang,Male,175.0,79.0,N
48,Fudan University,Sophomore,Mei Xu,Male,177.3,79.0,N
53,Tsinghua University,Sophomore,Chengli You,Female,164.1,57.0,N
55,Tsinghua University,Sophomore,Chengquan Zhang,Female,168.9,54.0,N
61,Peking University,Sophomore,Xiaopeng Qin,Male,172.8,NaN,N
65,Shanghai Jiao Tong University,Sophomore,Gaoli Xu,Female,164.9,53.0,N
68,Fudan University,Sophomore,Chengqiang Lv,Female,166.8,53.0,N
71,Shanghai Jiao Tong University,Sophomore,Feng Han,Male,183.4,82.0,N
74,Tsinghua University,Sophomore,Yanli Qin,Male,169.4,74.0,Y
76,Tsinghua University,Sophomore,Yanquan Lv,Male,174.6,NaN,N
101,Peking University,Sophomore,Xiaoli Zhou,Female,166.8,55.0,N
135,Fudan University,Sophomore,Changqiang Qian,Male,167.6,64.0,N
170,Fudan University,Sophomore,Li Sun,Female,165.1,57.0,N
182,Tsinghua University,Sophomore,Xiaoqiang Qian,Male,170.5,73.0,N

In [142]:
df.query('Grade == ["Freshman"] and Gender == "Male"')

,School,Grade,Name,Gender,Height,Weight,Transfer
1,Peking University,Freshman,Changqiang You,Male,166.5,70.0,N
10,Shanghai Jiao Tong University,Freshman,Xiaopeng Zhou,Male,174.1,74.0,N
35,Peking University,Freshman,Gaoli Zhao,Male,175.4,78.0,N
36,Peking University,Freshman,Xiaojuan Qin,Male,NaN,79.0,Y
38,Peking University,Freshman,Qiang Han,Male,185.3,87.0,N
54,Peking University,Freshman,Xiaojuan Chu,Male,162.4,58.0,Y
60,Shanghai Jiao Tong University,Freshman,Yanpeng Lv,Male,NaN,65.0,N
73,Fudan University,Freshman,Feng Wang,Male,176.3,74.0,N
99,Peking University,Freshman,Changpeng Zhao,Male,181.3,83.0,N
117,Shanghai Jiao Tong University,Freshman,Chunli Zhao,Male,180.2,83.0,N
153,Shanghai Jiao Tong University,Freshman,Changmei Lv,Male,172.2,75.0,N
184,Shanghai Jiao Tong University,Freshman,Qiang Feng,Male,178.9,80.0,N

In [145]:
# 外部变量
low, high = 75, 80
df.query('Weight.between(@low, @high)')

,School,Grade,Name,Gender,Height,Weight,Transfer
35,Peking University,Freshman,Gaoli Zhao,Male,175.4,78.0,N
36,Peking University,Freshman,Xiaojuan Qin,Male,NaN,79.0,Y
40,Tsinghua University,Sophomore,Li Wang,Male,175.0,79.0,N
48,Fudan University,Sophomore,Mei Xu,Male,177.3,79.0,N
82,Fudan University,Junior,Changfeng Lv,Male,175.6,76.0,N
95,Tsinghua University,Junior,Yanfeng Qian,Male,178.7,75.0,N
127,Peking University,Senior,Changquan Han,Male,173.4,77.0,N
153,Shanghai Jiao Tong University,Freshman,Changmei Lv,Male,172.2,75.0,N
158,Tsinghua University,Junior,Chengqiang Zhang,Male,176.1,76.0,N
171,Shanghai Jiao Tong University,Senior,Xiaofeng Zhang,Male,176.4,80.0,N
178,Tsinghua University,Sophomore,Li Qin,Male,NaN,76.0,N
184,Shanghai Jiao Tong University,Freshman,Qiang Feng,Male,178.9,80.0,N
193,Tsinghua University,Senior,Xiaoqiang Qin,Male,193.9,79.0,N